# 1. DATAFRAME CONCATENATION

In [2]:
# Import Pandas
import pandas as pd

In [3]:
# Creating a dataframe from a dictionary
# Let's define a dataframe with a list of bank clients with IDs = 1, 2, 3, 4, 5 
# Check this out: https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

raw_data = {'Bank Client ID': ['1', '2', '3', '4', '5'],
           'First Name': ['Nancy', 'Alex', 'Shep', 'Max', 'Allen'],
           'Last Name': ['Rob', 'Ali', 'George', 'Mitch', 'Steve']}
raw_data

bank1_df = pd.DataFrame(raw_data, columns = ['Bank Client ID', 'First Name', 'Last Name'])

bank1_df

  Bank Client ID First Name Last Name
0              1      Nancy       Rob
1              2       Alex       Ali
2              3       Shep    George
3              4        Max     Mitch
4              5      Allen     Steve

In [4]:
# Let's define another dataframe for a separate list of clients (IDs = 6, 7, 8, 9, 10)
raw_data = {'Bank Client ID': [str(i) for i in range(6, 11)],
           'First Name': ['Albert', 'Vince', 'Warren', 'Jason', 'Martin'],
           'Last Name': ['Felix', 'Hernandez', 'Carter', 'Walker', 'Smith']}
raw_data

bank2_df = pd.DataFrame(raw_data, columns = ['Bank Client ID', 'First Name', 'Last Name'])

bank2_df

  Bank Client ID First Name  Last Name
0              6     Albert      Felix
1              7      Vince  Hernandez
2              8     Warren     Carter
3              9      Jason     Walker
4             10     Martin      Smith

In [6]:
# Let's concatenate both dataframes #1 and #2
# Note that we now have client IDs from 1 to 10
# Note that by default ignore_index has been set to False meaning indexes from both dataframes are kept unchanged
bank_all_df = pd.concat([bank1_df, bank2_df])
bank_all_df

  Bank Client ID First Name  Last Name
0              1      Nancy        Rob
1              2       Alex        Ali
2              3       Shep     George
3              4        Max      Mitch
4              5      Allen      Steve
0              6     Albert      Felix
1              7      Vince  Hernandez
2              8     Warren     Carter
3              9      Jason     Walker
4             10     Martin      Smith

In [7]:
# Let's concatenate both dataframes #1 and #2
# Note that by setting ignore_index = True, the index has been automatically set to numeric and now ranges from 1 to 9
bank_all_df = pd.concat([bank1_df, bank2_df], ignore_index=True)
bank_all_df

  Bank Client ID First Name  Last Name
0              1      Nancy        Rob
1              2       Alex        Ali
2              3       Shep     George
3              4        Max      Mitch
4              5      Allen      Steve
5              6     Albert      Felix
6              7      Vince  Hernandez
7              8     Warren     Carter
8              9      Jason     Walker
9             10     Martin      Smith

In [8]:
len(bank_all_df)

10

In [9]:
# You can also use the append method to perform similar task
# Note that order matters!
bank_all_df = bank2_df.append(bank1_df, ignore_index=True)
bank_all_df

/var/folders/7w/96n4332d1k95m5_ly0gmyjw00000gn/T/ipykernel_42573/322344681.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  bank_all_df = bank2_df.append(bank1_df, ignore_index=True)

  Bank Client ID First Name  Last Name
0              6     Albert      Felix
1              7      Vince  Hernandez
2              8     Warren     Carter
3              9      Jason     Walker
4             10     Martin      Smith
5              1      Nancy        Rob
6              2       Alex        Ali
7              3       Shep     George
8              4        Max      Mitch
9              5      Allen      Steve

In [10]:
# You can also use the append method to perform similar task 
bank_all_df = bank1_df.append(bank2_df, ignore_index=True)
bank_all_df

/var/folders/7w/96n4332d1k95m5_ly0gmyjw00000gn/T/ipykernel_42573/2743169514.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  bank_all_df = bank1_df.append(bank2_df, ignore_index=True)

  Bank Client ID First Name  Last Name
0              1      Nancy        Rob
1              2       Alex        Ali
2              3       Shep     George
3              4        Max      Mitch
4              5      Allen      Steve
5              6     Albert      Felix
6              7      Vince  Hernandez
7              8     Warren     Carter
8              9      Jason     Walker
9             10     Martin      Smith

**MINI CHALLENGE #1:**
- **Assume that you and your significant other become a new client at the bank and would like to add your first names, last names and unique client IDs. Define a new DataFrame and add it to the master list "bank_all_df"**

In [12]:
new_data = {'Bank Client ID': [str(i) for i in range(11, 13)],
           'First Name': ['Justin', 'Sophie'], 'Last Name': ['Trudeau', 'Trudeau']}

In [13]:
bank3_df = pd.DataFrame(new_data, columns = ['Bank Client ID', 'First Name', 'Last Name'])
bank3_df

  Bank Client ID First Name Last Name
0             11     Justin   Trudeau
1             12     Sophie   Trudeau

In [14]:
bank_all_df = pd.concat([bank_all_df, bank3_df], ignore_index=True)
bank_all_df

   Bank Client ID First Name  Last Name
0               1      Nancy        Rob
1               2       Alex        Ali
2               3       Shep     George
3               4        Max      Mitch
4               5      Allen      Steve
5               6     Albert      Felix
6               7      Vince  Hernandez
7               8     Warren     Carter
8               9      Jason     Walker
9              10     Martin      Smith
10             11     Justin    Trudeau
11             12     Sophie    Trudeau

# 2. DATAFRAME CONCATENATION WITH MULTI-INDEXING

In [24]:
bank1_df

  Bank Client ID First Name Last Name
0              1      Nancy       Rob
1              2       Alex       Ali
2              3       Shep    George
3              4        Max     Mitch
4              5      Allen     Steve

In [25]:
bank2_df

  Bank Client ID First Name  Last Name
0              6     Albert      Felix
1              7      Vince  Hernandez
2              8     Warren     Carter
3              9      Jason     Walker
4             10     Martin      Smith

In [26]:
# We can perform concatenation and also use multi-indexing dataframe as follows:
bank_all_df = pd.concat([bank1_df, bank2_df], keys=['Customer Group 1', 'Customer Group 2'])
bank_all_df

                   Bank Client ID First Name  Last Name
Customer Group 1 0              1      Nancy        Rob
                 1              2       Alex        Ali
                 2              3       Shep     George
                 3              4        Max      Mitch
                 4              5      Allen      Steve
Customer Group 2 0              6     Albert      Felix
                 1              7      Vince  Hernandez
                 2              8     Warren     Carter
                 3              9      Jason     Walker
                 4             10     Martin      Smith

In [28]:
# You can access elements using multi-indexing as follows
bank_all_df.loc[('Customer Group 1'), :]

  Bank Client ID First Name Last Name
0              1      Nancy       Rob
1              2       Alex       Ali
2              3       Shep    George
3              4        Max     Mitch
4              5      Allen     Steve

In [29]:
# You can access elements using multi-indexing as follows
bank_all_df.loc[('Customer Group 1'), 0]

Bank Client ID        1
First Name        Nancy
Last Name           Rob
Name: (Customer Group 1, 0), dtype: object

In [30]:
# You can access elements using multi-indexing as follows
bank_all_df.loc[('Customer Group 2'), 'First Name']

0    Albert
1     Vince
2    Warren
3     Jason
4    Martin
Name: First Name, dtype: object

**MINI CHALLENGE #2:**
- **Assume that you and your significant other belong to Customers Group #3. Use multindexing to add both names to the master list. Write a line of code to access Group #3 only.**

In [31]:
new_data = {'Bank Client ID': [str(i) for i in range(11, 13)],
           'First Name': ['Justin', 'Sophie'], 'Last Name': ['Trudeau', 'Trudeau']}

bank3_df = pd.DataFrame(new_data, columns=['Bank Client ID', 'First Name', 'Last Name'])
bank3_df

  Bank Client ID First Name Last Name
0             11     Justin   Trudeau
1             12     Sophie   Trudeau

In [32]:
bank_all_df = pd.concat([bank1_df, bank2_df, bank3_df], keys=['Customer Group 1', 'Customer Group 2', 'Customer Group 3'])
bank_all_df

                   Bank Client ID First Name  Last Name
Customer Group 1 0              1      Nancy        Rob
                 1              2       Alex        Ali
                 2              3       Shep     George
                 3              4        Max      Mitch
                 4              5      Allen      Steve
Customer Group 2 0              6     Albert      Felix
                 1              7      Vince  Hernandez
                 2              8     Warren     Carter
                 3              9      Jason     Walker
                 4             10     Martin      Smith
Customer Group 3 0             11     Justin    Trudeau
                 1             12     Sophie    Trudeau

In [33]:
bank_all_df.loc[('Customer Group 3'), :]

  Bank Client ID First Name Last Name
0             11     Justin   Trudeau
1             12     Sophie   Trudeau

# 3. DATA MERGING

In [5]:
# Let's concatenate both dataframes #1 and #2
# Note that we now have client IDs from 1 to 10
# Note that by default ignore_index has been set to False meaning indexes from both dataframes are kept unchanged
bank_all_df = pd.concat([bank1_df, bank2_df], ignore_index=True)
bank_all_df

  Bank Client ID First Name  Last Name
0              1      Nancy        Rob
1              2       Alex        Ali
2              3       Shep     George
3              4        Max      Mitch
4              5      Allen      Steve
5              6     Albert      Felix
6              7      Vince  Hernandez
7              8     Warren     Carter
8              9      Jason     Walker
9             10     Martin      Smith

In [9]:
# Let's assume we obtained additional information (Annual Salary) about our bank customers 
# Note that data obtained is for all clients with IDs 1 to 10
from random import randrange
raw_data = {'Bank Client ID': [str(i) for i in range(1, 11)],
           'Annual Salary [$/year]': [randrange(25000, 50000) for _ in range(10)]}
raw_data

{'Bank Client ID': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'],
 'Annual Salary [$/year]': [30800,
  43647,
  29075,
  40296,
  26804,
  29903,
  34563,
  32371,
  48079,
  26496]}

In [10]:
# Let's merge all data on 'Bank Client ID'
bank_salary_df = pd.DataFrame(raw_data, columns=['Bank Client ID', 'Annual Salary [$/year]'])
bank_salary_df

  Bank Client ID  Annual Salary [$/year]
0              1                   30800
1              2                   43647
2              3                   29075
3              4                   40296
4              5                   26804
5              6                   29903
6              7                   34563
7              8                   32371
8              9                   48079
9             10                   26496

In [11]:
 # Let's merge all data 'Bank Client ID'
bank_all_df = pd.merge(bank_all_df, bank_salary_df, on='Bank Client ID')
bank_all_df

  Bank Client ID First Name  Last Name  Annual Salary [$/year]
0              1      Nancy        Rob                   30800
1              2       Alex        Ali                   43647
2              3       Shep     George                   29075
3              4        Max      Mitch                   40296
4              5      Allen      Steve                   26804
5              6     Albert      Felix                   29903
6              7      Vince  Hernandez                   34563
7              8     Warren     Carter                   32371
8              9      Jason     Walker                   48079
9             10     Martin      Smith                   26496

**MINI CHALLENGE #3:**
- **Let's assume that you were able to obtain two new pieces of information about the bank clients such as: (1) credit card debt, (2) age**
- **Define a new DataFrame that contains this new information**
- **Merge this new information to the DataFrame "bank_all_df".**

In [12]:
raw_data = {'Bank Client ID': [str(i) for i in range(1, 11)],
           'Credit Card Debt': [randrange(100, 4000) for _ in range(10)],
           'Age': [randrange(20, 78) for _ in range(10)]}
bank_credit_age_df = pd.DataFrame(raw_data, columns = ['Bank Client ID', 'Credit Card Debt', 'Age'])
bank_credit_age_df

  Bank Client ID  Credit Card Debt  Age
0              1              2726   40
1              2               787   21
2              3              3465   66
3              4              3104   30
4              5               667   61
5              6              2636   56
6              7              1217   25
7              8              1078   64
8              9              2988   61
9             10              2720   52

In [13]:
bank_all_df = pd.merge(bank_all_df, bank_credit_age_df, on='Bank Client ID')
bank_all_df

,Bank Client ID,First Name,Last Name,Annual Salary [$/year],Credit Card Debt,Age
0,1,Nancy,Rob,30800,2726,40
1,2,Alex,Ali,43647,787,21
2,3,Shep,George,29075,3465,66
3,4,Max,Mitch,40296,3104,30
4,5,Allen,Steve,26804,667,61
5,6,Albert,Felix,29903,2636,56
6,7,Vince,Hernandez,34563,1217,25
7,8,Warren,Carter,32371,1078,64
8,9,Jason,Walker,48079,2988,61
9,10,Martin,Smith,26496,2720,52

# MINI CHALLENGES SOLUTIONS

**MINI CHALLENGE #1 SOLUTION:**
- **Assume that you and your significant other become a new client at the bank and would like to add your first names, last names and unique client IDs. Define a new DataFrame and add it to the master list "bank_all_df"**

In [ ]:
new_data = {'Bank Client ID': ['11', '12'],
            'First Name': ['Justin', 'Sophie'], 
            'Last Name': ['Trudeau', 'Trudeau']}

bank3_df = pd.DataFrame(new_data, columns = ['Bank Client ID', 'First Name', 'Last Name'])
bank3_df

In [ ]:
# Let's concatenate both dataframes #1 and #2
# Note that by setting ignore_index = True, the index has been automatically set to numeric and now ranges from 1 to 9
bank_all_df = pd.concat([bank_all_df, bank3_df], ignore_index = True)
bank_all_df

**MINI CHALLENGE #2 SOLUTION:**
- **Assume that you and your significant other belong to Customers Group #3. Use multindexing to add both names to the master list. Write a line of code to access Group #3 only.**

In [ ]:
bank1_df

In [ ]:
bank2_df

In [ ]:
new_data = {'Bank Client ID': ['11', '12'],
            'First Name': ['Justin', 'Sophie'], 
            'Last Name': ['Trudeau', 'Trudeau']}

bank3_df = pd.DataFrame(new_data, columns = ['Bank Client ID', 'First Name', 'Last Name'])
bank3_df

In [ ]:
# We can perform concatenation and also use multi-indexing dataframe as follows:
bank_all_df = pd.concat([bank1_df, bank2_df, bank3_df], keys = ["Customers Group 1", "Customers Group 2",  "Customers Group 3"])
bank_all_df

In [ ]:
# You can access elements using multi-indexing as follows
bank_all_df.loc[("Customers Group 3"), :]

**MINI CHALLENGE #3 SOLUTION:**
- **Let's assume that you were able to obtain two new pieces of information about the bank clients such as: (1) credit card debt, (2) age**
- **Define a new DataFrame that contains this new information**
- **Merge this new information to the DataFrame "bank_all_df".**

In [ ]:
# Let's assume we obtained additional information (Annual Salary) about our bank customers 
# Note that data obtained is for all clients with IDs 1 to 10
 
raw_data = {
        'Bank Client ID': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'],
        'Credit Card Debt': [1000, 100, 500, 600, 0, 20, 360, 127, 3000, 2200],
        'Age': [44, 35, 67, 19, 22, 45, 48, 33, 34, 36]}
bank_credit_age_df = pd.DataFrame(raw_data, columns = ['Bank Client ID','Credit Card Debt', 'Age'])
bank_credit_age_df

In [ ]:
# Let's merge all data on 'Bank Client ID'
bank_all_df = pd.merge(bank_all_df, bank_credit_age_df, on = 'Bank Client ID')
bank_all_df